----------------------------------------------------------------
-- 程序功能： 规则-包体应用名称
-- 程序名： P_dim_rule_core_lang_app
-- 目标表： dim.dim_rule_core_lang_app
-- 负责人： qhr
-- 开发日期： 2026-04-30
----------------------------------------------------------------

insert into dim.dim_rule_core_lang_app (biz_type_code,core,lang_code,biz_type_name,lang_name,app_name)
values
 (2,1,-99,'海剧',NULL,'Moboreels')
,(2,2,-99,'海剧',NULL,'MoboShort')
,(2,3,-99,'海剧',NULL,'BestReels')
,(2,4,-99,'海剧',NULL,'MiniDrama')
,(2,5,-99,'海剧',NULL,'MoboDrama')
,(1,1,7,'海阅','俄语','Litrad')
,(1,1,6,'海阅','法语','Kifflire')
,(1,1,2,'海阅','繁体','暢讀書城')
,(1,1,1,'海阅','简体','畅读书城/安卓读书')
,(1,1,5,'海阅','葡语','Lera')
,(1,1,9,'海阅','日语','蒼海本棚')
,(1,1,12,'海阅','泰语','Meghabook')
,(1,1,4,'海阅','西语','Manobook')
,(1,1,11,'海阅','印尼语','Bakisah')
,(1,1,3,'海阅','英语','MoboReader')
,(1,2,7,'海阅','俄语','Chitets')
,(1,2,6,'海阅','法语','Onlit')
,(1,2,2,'海阅','繁体','暖暖小說')
,(1,2,1,'海阅','简体','畅读小说')
,(1,2,5,'海阅','葡语','Amolivro')
,(1,2,9,'海阅','日语','アイドク')
,(1,2,12,'海阅','泰语','Romanread')
,(1,2,4,'海阅','西语','Novella')
,(1,2,11,'海阅','印尼语','Ceriaca')
,(1,2,3,'海阅','英语','Readnow')
,(1,3,7,'海阅','俄语','Knigorad')
,(1,3,6,'海阅','法语','Mobilis')
,(1,3,2,'海阅','繁体','掌上小說大全')
,(1,3,5,'海阅','葡语','Lelivro')
,(1,3,9,'海阅','日语','本を読もう')
,(1,3,12,'海阅','泰语','Pinknovel')
,(1,3,4,'海阅','西语','Leera')
,(1,3,11,'海阅','印尼语','pobaca')
,(1,3,3,'海阅','英语','WeRead')
,(1,4,-99,'海阅',NULL,'BestNovel')
;
