----------------------------------------------------------------
-- 程序功能： 规则-productid语言映射
-- 程序名： P_dim_rule_productid_lang_mapping
-- 目标表： dim.dim_rule_productid_lang_mapping
-- 负责人： qhr
-- 开发日期： 2026-05-13
----------------------------------------------------------------

insert into dim.dim_rule_productid_lang_mapping (site_id, recharge_product_id, lang_id, app_name, lang_name, lang_code, publish_name, shuangwen_product_id, server_product_id, beidou_biz_type, beidou_biz_type_name, pub_biz_type, pub_biz_type_name)
values
 (null, 8858, 1, '新畅读读书', '新畅读读书', 'cd2', null, null, null, null, null, null, null),
 (null, 7757, 1, '新安卓读书', '新安卓读书', 'and2', null, null, null, null, null, null, null),
 (null, 8888, 1, '畅读书城', '畅读书城', 'cd', null, null, null, null, null, null, null),
 (null, 7777, 1, '安卓读书', '安卓读书', 'and', null, null, null, null, null, null, null),
 (26, 3333, 2, '繁体', '繁体', 'ft', '繁体上传专区', null, null, null, null, null, null),
 (446, 3333, 2, '繁体', '繁体', 'ft', '繁体', 3311, 3333, 1, '海阅', 1, '海阅'),
 (450, 3333, 2, '繁体', '繁体', 'ft', '繁体', 3366, 3333, 1, '海阅', 1, '海阅'),
 (322, 3366, 3, '英语', '英语', 'en', '畅读英文', 3366, 3366, 1, '海阅', 1, '海阅'),
 (375, 3388, 4, '西语', '西语', 'sp', '畅读西班牙', 3388, 3388, 1, '海阅', 1, '海阅'),
 (409, 3322, 5, '葡语', '葡语', 'pt', '畅读葡语', 3322, 3322, 1, '海阅', 1, '海阅'),
 (410, 3311, 6, '法语', '法语', 'fr', '畅读法语', 3311, 3311, 1, '海阅', 1, '海阅'),
 (418, 3371, 7, '俄语', '俄语', 'ru', '俄语', 3311, 3371, 1, '海阅', 1, '海阅'),
 (413, 3571, 8, '意大利语', '意大利语', 'it', '意大利语', 3311, 3571, 1, '海阅', 1, '海阅'),
 (419, 3399, 9, '日语', '日语', 'jp', '日语', 3311, 3399, 1, '海阅', 1, '海阅'),
 (415, 3581, 10, '阿拉伯语', '阿拉伯语', 'ar', '阿拉伯语', 3311, 3366, 1, '海阅', 1, '海阅'),
 (414, 3501, 11, '印尼', '印尼', 'id', '印地语', 3311, 3501, 1, '海阅', 1, '海阅'),
 (433, 3511, 12, '泰语', '泰语', 'th', '泰语', 3311, 3511, 1, '海阅', 1, '海阅'),
 (435, 3521, 13, '越南语', '越南语', 'vi', '越南语', 3366, 3366, 1, '海阅', 1, '海阅'),
 (436, 3531, 14, '韩语', '韩语', 'ko', '韩语', 3366, 3366, 1, '海阅', 1, '海阅'),
 (445, 3541, 15, '菲律宾语', '菲律宾语', 'tl', '菲律宾语', 3366, 3366, 1, '海阅', 1, '海阅'),
 (412, 3561, 16, '德语', '德语', 'de', '德语', 3311, 3366, 1, '海阅', 1, '海阅'),
 (447, 3591, 17, '印地语', '印地语', 'hi', '印地语', 3366, 3591, 1, '海阅', 1, '海阅'),
 (448, 3611, 18, '孟加拉语', '孟加拉语', 'bn', '孟加拉语', null, 3611, 1, '海阅', 1, '海阅'),
 (491, 3366, 19, '海外简体', '海外简体', 'ncn', '新简体', null, 3366, 1, '海阅', 1, '海阅'),
 (492, 3366, 20, '海外繁体', '海外繁体', 'nft', '新繁体', null, 3367, 1, '海阅', 1, '海阅'),
 (495, 3631, 21, '马来西亚语', '马来西亚语', 'my', '马来西亚语', 3366, 3368, 1, '海阅', 1, '海阅'),
 (497, 3621, 22, '土耳其语', '土耳其语', 'tr', '土耳其语', 3366, 3369, 1, '海阅', 1, '海阅'),
 (501, 3651, 23, '波兰语', '波兰语', 'pl', '波兰', 3366, 3370, null, null, null, null),
 (499, 6833, null, '海剧', '海剧简体', null, '海剧简体', null, null, 3, '海剧', 2, '海剧'),
 (null, 2311, null, '圣经', null, null, null, null, null, null, null, null, null)
;
